Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase class provides the base class for creating the custom parts.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase.inputPointType
The input point type of the custom part.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase.#ctor(System.Int32,System.String,System.Boolean,System.Int32)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase class.
id: The identifier.
name: The name.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.
inputPointCount: The number of input points of the custom part, max point count is 2.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase.CustomPart
Gets the main component of the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase.CommitCustomPartInput(Tekla.Structures.Model.Polygon)
Commits the custom part input and creates new instance. Minimum point count is 1.
input: The input.